app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("content", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Task 1"], ["project_id", 2], ["created_at", "2019-06-28 07:27:03.451709"], ["updated_at", "2019-06-28 07:27:03.451709"]]
---
	def create
		@task=@project.tasks.create(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
---
	def destroy

		if @task.destroy

UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2019-06-28 07:25:08.276842"], ["updated_at", "2019-06-28 07:25:08.277359"], ["id", 2]]
---
	def complete
		@task.update_attribute(:completed_at, Time.now)